{
    // Controls when the output panel is hidden. true only shows the output
    // panel upon error. false always shows the output panel and never hides
    // it. (number) shows the output panel and hides it after (number) seconds.
    "hide_output_panel" : true,

    // If the connection should use ftp, ftps or sftp. Changing this also automatically changes the port, if it is not specified. 
    "type": "sftp",

    // A boolean (true or false) setting that controls whether or not files will 
    // be saved before uploading. This only affects files uploaded via the 
    // keyboard command.
    "save_before_upload": false,

    // If files should be automatically uploaded when saved. Files that match the 
    // ignore_regex pattern are not automatically uploaded.
    "upload_on_save": false,

    // When a file is opened, the remote file modification time will be checked. 
    // If it is newer, the user will be prompted if they wish to download it.
    "sync_down_on_open": false,

    // When performing Sync Up and Sync Down command, skip looking for files to
    // delete.
    "sync_skip_deletes": false,

    // If files that are approximately the same age should be transfered when
    // syncing. The FTP and SFTP protocols do not report modification time beyond
    // the granularity of the minute, meaning that files that are the "same age"
    // may, in fact, be different.
    "sync_same_age": false,

    // If a yes/no confirmation should be presented to the user when downloading
    // a file or folder.
    "confirm_downloads": false,

    // If a yes/no confirmation should be presented to the user when performing
    // sync commands.
    "confirm_sync": true,

    // If the user should be presented with a yes/no confirmation when uploading
    // a file with a modification time that is older than the version of the file
    // on the server. This only works when uploading individual files. Please note
    // that setting this to true will have a slight affect on performance since a
    // remote file listing will need to be performed on each file upload.
    "confirm_overwrite_newer": false,
    
    // The domain name or IP address to connect to
    "host": "grafika.co.za",

    // The username to use when connecting to the host.
    "user": "grafikac",

    // The password to use. This is not necessary if using an sftp connection with SSH keys.
    "password": "!Grafika@bsv510mp!",

    // The port number to connect to. This is only necessary if using a non-standard port for the type specified. 
    // When creating an ftps connection, if the port is set to 990, an implicit SSL connection will be made, as 
    // opposed to the server and client negotiating the security.
    //"port": "22",
    
    // For the Remote workflow, the absolute path on the remote to map the current folder to.
    "remote_path": "/home/grafikac/public_html/wp-content/plugins/grafiplug/",

    // A list of regular expressions to compare with file and folder paths to see 
    // if they should be ignored. The complete path to the file or folder will be
    // compared to this regular expression. This uses the Python re module, and
    // regular expression must be compatible with that. A literal backslash requires
    // four backslashes since both JSON and regular expressions require backslashes
    // to be escaped.
    "ignore_regexes": [
        
        // Specific Files
        "\\.sublime-(project|workspace)",
        "sftp-config(-alt\\d?)?\\.json",
        "sftp-settings\\.json",
        "bower\\.json",
        "package\\.json",
        "\\.bowerrc",
        "\\.csscomb\\.json",
        "\\.csslintrc",
        "\\.DS_Store",
        "Thumbs\\.db",
        "desktop\\.ini",
        "_darcs",
        "CVS",
        "gulpfile.js",
        "GULP",
        
        // Folders
        "/dev/",

        // File types
        "\\.list",
        "\\.svn",
        "\\.psd",
        "\\.ai",
        "\\.cdr",
        "\\.less",
        "\\.hg",
        "\\.git",
        "\\.bzr"
    ],

    // The octal permissions to chmod files to. This should not start with a 0.
    //"file_permissions": "664",

    // The octal permissions to chmod folders to. This should not start with a 0
    //"dir_permissions": "775",
    
    // The number of additional connections to create to the server when performing 
    // the list commands that are used to determine what operations should be 
    // performed during a sync. Adding extra connections can drastically improve 
    // the performance of sync for large folder trees.
    "extra_list_connections": 10,

    // The number of seconds to timeout after when trying to connect.
    "connect_timeout": 30,

    // The number of seconds between sending a dummy command to the server to keep 
    // the connection open. For FTP connections, the command is NOOP, for SFTP 
    // connections, the command is cd .. Setting this to 0 disables keepalive commands.
    "keepalive": 120,

    // If pasv mode should be used for the FTP connection. If the first upload to an 
    // FTP server takes a long time, try setting this to false. While this is not 
    // set explicitly by default in the plugin, the Python ftp library defaults to 
    // using passive mode.
    "ftp_passive_mode": true,

    //"ftp_obey_passive_host": false,

    // The SSH private key file to use for an sftp connection. Linux and OS X will 
    // use the private key in ~/.ssh/ by default. On Windows this should be a .ppk 
    // file generated via Pageant.
    //"ssh_key_file": "~/.ssh/id_rsa",

    // Raw command line flags to send to the sftp binary when on Linux or OS X, or 
    // the psftp.exe binary when on Windows. Each flag should be a separate entry 
    // in the list.
    //"sftp_flags": ["-F", "/path/to/ssh_config"],
    
    // If the modification times of files should be preserved when uploading and 
    // downloading. This setting may be false, true (for uploads and downloads) and 
    // "download_only". "download_only" may be required since this functionality is 
    // not available on all FTP servers.
    "preserve_modification_times": false,

    // The number of hours difference between the local machine and remote/server. 
    // This is normally determined automatically when connecting and should not normally 
    // need to be set.
    //"remote_time_offset_in_hours": 0,

    // The remote encoding to use for unicode file paths. Normally this only needs to 
    // be adjusted for Windows FTP servers if using unicode file paths.
    //"remote_encoding": "utf-8",

    // This settings is used to parse the last modified timestamps on remote files. 
    // Normally this should not need to be adjusted.
    //"remote_locale": "C",

    "allow_config_upload": false,
}
